Repository: fdechelle/glpi-plugins-doc
Catalog: source/locale/*/LC_MESSAGES/scim/azure.po
Languages: pt_br

source: Azure portal
pt_br: Portal do Azure

source: References:
pt_br: Referências:

source: Setup
pt_br: Configuração

source: Select **New application** and choose **Create your own application**.
pt_br: Selecione **Nova aplicação** e escolha **Criar sua própria aplicação**.

source: Choose a name for your application, select **Integrate any other application you don’t find in the gallery (Non-gallery)** and click on the **[Create]** button.
pt_br: Escolha um nome para o seu aplicativo, selecione **Integrar qualquer outro aplicativo que você não encontre na galeria (Não-galeria)** e clique no botão **[Criar]**.

source: Azure create app
pt_br: Azure criar aplicativo

source: In the “Provisioning” section,
pt_br: Na seção "Provisionamento",

source: Select **Automatic**,
pt_br: Selecione **Automático**.

source: Fill **Tenant Url** with the API url of your SCIM server you copied from the :ref:`plugin configuration <setup_scim>`.
pt_br: Preencha **Tenant Url** com a URL da API do seu servidor SCIM que você copiou da :ref:`configuração do plugin <setup_scim>`.

source: Optionally, fill **Secret** field: For Azure, the awaited secret is a long life valid jwt token. We cannot use an oauth exchange (Azure doesn’t ask for an authorize URL). So in GLPI, setup you SCIM server with **Bearer** security and paste the JWT token from GLPI in the **Secret token** field of Azure.
pt_br: Opcionalmente, preencha o campo **Secret**: Para o Azure, o segredo esperado é um token jwt válido por longo tempo de vida. Não podemos usar uma troca de oauth (o Azure não solicita uma URL de autorização). Portanto, no GLPI, configure seu servidor SCIM com segurança **Bearer** e cole o token JWT do GLPI no campo **Token secreto** do Azure.

source: Click on the **Test connection** button to validate your parameters.
pt_br: Clique no botão **Testar conexão** para validar seus parâmetros.

source: If the test succeed, click on the **[Save]** button.
pt_br: Se o teste for bem-sucedido, clique no botão **[Salvar]**.

source: Azure Configuration provisioning
pt_br: Configuração de provisionamento do Azure

source: You must choose in the **Parameters** > **Extended** section how you want to synchronize your users and groups:
pt_br: Você deve escolher na seção **Parâmetros** > **Estendido** como deseja sincronizar seus usuários e grupos.

source: Only users and groups assigned to the application. In this case, you must manually assign your users and groups to the application in the **Users and groups** section.
pt_br: Apenas usuários e grupos atribuídos à aplicação. Neste caso, você deve atribuir manualmente seus usuários e grupos à aplicação na seção **Usuários e grupos**.

source: All users and groups in the directory
pt_br: Todos os usuários e grupos no diretório

source: After checking the mapping section, enable the **Provisioning** at the bottom and click on the **[Save]** button.
pt_br: Depois de verificar a seção de mapeamento, habilite o **Provisionamento** na parte inferior e clique no botão **[Salvar]**.

source: You can check the advancement in the **Provisioning logs** section. Usually it start after a few minutes.
pt_br: Você pode verificar o progresso na seção **Logs de Provisionamento**. Geralmente, ele começa após alguns minutos.

source: Creative Commons License
pt_br: Licença Creative Commons
