Repository: fdechelle/glpi-plugins-doc
Catalog: source/locale/*/LC_MESSAGES/oauthimap/index.po
Languages: pt_br, tr_tr

source: Microsoft is gradually removing the TLS 1.0 and 1.1 protocols for all Microsoft 365 applications. In order to keep your collector running, you need to add the **Oauth IMAP** plugin, which is available in the marketplace.
pt_br: Microsoft está gradualmente removendo os protocolos TLS 1.0 e 1.1 para todas as aplicações do Microsoft 365. Para manter seu coletor em execução, você precisa adicionar o plugin **OAuth IMAP**, que está disponível no marketplace.

source: The Oauth tokens for the collector, retrieved during authentication with Azure by the OauthIMAP plugin, are “offline” tokens that delegate authorisation to a third-party application (GLPI). These tokens provide a renewal code that will be used by the application to renew them automatically without user intervention. You will therefore not be asked to re-authenticate after the 1st authorisation request.
pt_br: Os tokens Oauth para o coletor, obtidos durante a autenticação com o Azure pelo plugin OauthIMAP, são tokens "offline" que delegam autorização a um aplicativo de terceiros (GLPI). Esses tokens fornecem um código de renovação que será usado pelo aplicativo para renová-los automaticamente sem intervenção do usuário. Portanto, você não será solicitado a fazer uma nova autenticação após a 1ª solicitação de autorização.

source: Source and Download
pt_br: Fonte e Download

source: Sources link: https://github.com/pluginsGLPI/oauthimap
pt_br: Origem do link: https://github.com/pluginsGLPI/oauthimap
tr_tr: Kaynak bağlantısı: https://github.com/pluginsGLPI/oauthimap

source: Requirements (on-premise)
pt_br: Requisitos (localmente)

source: GLPI Version
pt_br: Versão do GLPI

source: Minimum PHP
pt_br: PHP mínimo

source: Recommended
pt_br: Recomendado

source: This plugin is available without a GLPI-Network subscription. It is also available in `Cloud <https://glpi-network.cloud/>`__
pt_br: Este plugin está disponível sem uma assinatura GLPI-Network. Também está disponível em `Nuvem <https://glpi-network.cloud/>`__

source: Supported mail services
pt_br: Suporta os seguintes serviços de email.

source: OAuth IMAP support :
pt_br: Suporte OAuth IMAP:

source: Install the plugin
pt_br: Instalar o plugin

source: Go to the marketplace. Download Oauth IMAP and enable it
pt_br: Vá para o marketplace. Baixe o Oauth IMAP e habilite-o.

source: Open the `Azure Portal <https://portal.azure.com/#home>`__ for your tenant
pt_br: Abra o `Portal Azure <https://portal.azure.com/#home>`__ para o seu locatário.

source: In the search box type **registration**
pt_br: Na caixa de pesquisa, digite **registration**

source: then select **App registrations**
pt_br: então selecione **Registros de aplicativos**

source: Here are the configuration steps including configuration phases on the Entra side.
pt_br: Aqui estão os passos de configuração, incluindo as fases de configuração do lado Entra.

source: Register your Entra application
pt_br: Registre sua aplicação Entra

source: Create the application
pt_br: Crie o aplicativo

source: Click on **New registration**
pt_br: Clique em **Nova inscrição**

source: Enter the desired name, select the type of account supported then enter the redirection URL (present in the configuration of the plugin from your GLPI interface: https://XXXXXXXXXXXXXX/marketplace/oauthimap/front/authorization.callback.php) specifying the **Web** option
pt_br: Digite o nome desejado, selecione o tipo de conta suportada e insira a URL de redirecionamento (presente na configuração do plugin da sua interface GLPI: https://XXXXXXXXXXXXXX/marketplace/oauthimap/front/authorization.callback.php) especificando a opção **Web**.

source: Then click on **Register**.
pt_br: Então clique em **Registrar**.

source: Add a secret
pt_br: Adicione um segredo

source: In the **Certificates and secrets** tab
pt_br: Na guia **Certificados e segredos**

source: Click on **Client secrets**
pt_br: Clique em **Segredos do cliente**

source: Then **New client secret**
pt_br: Então **Novo segredo do cliente**

source: Enter a description and then an expiration date
pt_br: Digite uma descrição e depois uma data de validade

source: A secret **value** is then generated. Keep this value well because once you have left this page, it will no longer be recoverable
pt_br: Um **valor** secreto é então gerado. Guarde bem esse valor porque uma vez que você sair desta página, ele não poderá mais ser recuperado.

source: Return to the **Overview** tab and **copy** the following values ​​and the secret seen above
pt_br: Retorne para a guia **Visão geral** e **copie** os seguintes valores e o segredo acima mencionado.

source: Setup GLPI
pt_br: Configurar GLPI

source: Now go back to your GLPI interface **Setup > Application Aouth IMAP** and indicate the information collected previously :
pt_br: Agora volte para a sua interface GLPI **Configuração > Aplicação Aouth IMAP** e indique as informações coletadas anteriormente:

source: Click **Add**
pt_br: Clique **Adicionar**

source: Now in the **Oauth authorization** tab, click **Create an authorization**
pt_br: Agora na guia **Autorização Oauth**, clique em **Criar uma autorização**.

source: When you click on **Create authorization**, you will be redirected to the Microsoft services sign-in page
pt_br: Quando você clicar em **Criar autorização**, você será redirecionado para a página de login dos serviços da Microsoft.

source: Enter the email address and password of the account that will be used for the collector
pt_br: Digite o endereço de e-mail e a senha da conta que será usada para o coletor

source: You will also need to accept the necessary permissions related to the plugin.
pt_br: Você também precisará aceitar as permissões necessárias relacionadas ao plugin.

source: Creative Commons License
pt_br: Licença Creative Commons

source: Download: https://github.com/pluginsGLPI/oauthimap/releases
tr_tr: İndirme bağlantısı: https://github.com/pluginsGLPI/oauthimap/releases

source: Features
tr_tr: Özellikler

source: This plugin supports Oauth connection for emails receivers.
tr_tr: Bu uygulama eki, e-posta alıcıları için OAuth bağlantısını destekler.

source: Supported mail services:
tr_tr: Desteklenen e-posta hizmetleri:

source: `G Suite and Gmail <https://developers.google.com/gmail/imap/xoauth2-protocol>`_,
tr_tr: `G Suite ve Gmail <https://developers.google.com/gmail/imap/xoauth2-protocol>`_,

source: Install the Plugin
tr_tr: Uygulama ekini kurun

source: Plugin is available inside GLPI marketplace.
tr_tr: Uygulama eki GLPI mağazasından alınabilir.

source: You can also install it manually:
tr_tr: İsterseniz el ile de kurabilirsiniz:

source: Uncompress the archive.
tr_tr: Arşivi ayıklayın.

source: Move the ``oauthimap`` directory to the ``<GLPI_ROOT>/plugins`` directory.
tr_tr: ``oauthimap`` klasörünü ``<GLPI_ROOT>/plugins`` klasörüne taşıyın

source: Navigate to the *Setup > Plugins* page.
tr_tr: *Yapılandırma > Uygulama ekleri* bölümüne gidin.

source: Install and activate the plugin.
tr_tr: Uygulama ekini kurup etkinleştirin.

source: Configure your Oauth IMAP application
tr_tr: OAuth IMAP uygulamasını yapılandırın

source: To be able to connect to a mailbox using Oauth authentication, you first need to configure your *Oauth IMAP application*:
tr_tr: OAuth kimlik doğrulamasını kullanarak bir e-posta kutusuna bağlanabilmek için önce *OAuth IMAP uygulamanızı* yapılandırmanız gerekir:

source: Register an external application on service provider management console;
tr_tr: Hizmet sağlayıcı yönetimi panosuna bir dış uygulama kaydedin;

source: Create an item in *Setup > Oauth IMAP applications* using *id* and *secret* of your provider application;
tr_tr: *Yapılandırma > OAuth IMAP uygulamaları* bölümünden hizmet sağlayıcınızın *kimlik* ve *parola* bilgilerini kullanarak bir öge oluşturun;

source: Copy callback url from the Oauth IMAP application configuration and fill it in the provider console (GLPI will be called back after authentication process).
tr_tr: OAuth IMAP uygulama yapılandırmasından geri dönüş adresini kopyalayın ve hizmet sağlayıcı panosundaki yerine yapıştın (doğrulama işleminden sonra GLPI sayfasına geri dönülür).

source: Create an authorization
tr_tr: Yetki oluşturun

source: Once your Oauth IMAP application created, you will need to create an authorization that will be used to authenticate on your mailbox. To do so, go in the *Oauth authorization* tab of your Oauth IMAP application, and click on *Create an authorization*.
tr_tr: OAuth IMAP uygulamanız oluşturulduktan sonra, e-posta kutunuzda kimlik doğrulaması için kullanılacak bir yetkilendirme oluşturmanız gerekir. Bunu yapmak için, OAuth IMAP uygulamanızın *OAuth yetkilendirmesi* sekmesine gidin ve *Yetki oluştur* üzerine tıklayın.

source: You can create an authorization for each of the mailboxes you want to use in mail receivers. When you create an authorization for a mailbox, previously existing authorizations for this mailbox are discarded.
tr_tr: E-posta alıcılarında kullanmak istediğiniz e-posta kutularının her biri için bir yetki oluşturabilirsiniz. Bir e-posta kutusu için yetki oluşturduğunuzda, bu e-posta kutusu için önceden var olan yetkiler silinir.

source: Configure your mail receiver
tr_tr: E-posta alıcınızı yapılandırın

source: To authenticate via Oauth on your mail receiver, you have to change the configuration of your mail receiver:
tr_tr: E-posta alıcınızda OAuth kullanarak kimlik doğrulaması yapmak için e-posta alıcınızın yapılandırmasını değiştirmeniz gerekir:

source: choose your Oauth IMAP application in the first dropdown of *Connection options*;
tr_tr: *Bağlantı ayarları* bölümündeki ilk açılır menüden OAuth IMAP uygulamanızı seçin;

source: then choose an existing authorization in the *Login* dropdown or select *Create authorization for another user*.
tr_tr: Ardından *Oturum aç* açılır menüsünden var olan bir yetkilendirmeyi seçin veya *Başka bir kullanıcı için yetki oluştur* seçin.
