Repository: fdechelle/glpi-plugins-doc
Catalog: source/locale/*/LC_MESSAGES/pdf/index.po
Languages: fr_fr

source: GLPI Version
fr_fr: Version de GLPI

source: Minimum PHP
fr_fr: PHP minimum

source: Recommended
fr_fr: Recommandé

source: This plugin is available without a GLPI-Network subscription. It is also available in Cloud.
fr_fr: Ce plugin est disponible sans souscription GLPI-Network. Il est également disponible sur le Cloud.

source: Install the plugin
fr_fr: Installer le plugin

source: Go to the marketplace. Download and install the plugin **PDF**
fr_fr: Allez sur le marketplace. Téléchargez et installez le plugin **PDF**.

source: install the plugin
fr_fr: Installer le plugin

source: Set up the plugin
fr_fr: Configurer le plugin

source: From **Setup > General > Print to pdf**, select :
fr_fr: Depuis le menu **Configuration > Général > Imrpimer en PDF**, sélectionnez :

source: your preferred currency
fr_fr: votre devise préférée

source: Any text that will be displayed on the PDF.
fr_fr: N'importe quel texte qui sera affiché sur le PDF.

source: setup the plugin
fr_fr: Configurer le plugin

source: Using the plugin
fr_fr: Utiliser le plugin

source: Printing a contract and its related elements
fr_fr: Imprimer un contrat et ses éléments liés

source: From **Management > Contracts**, select the contract you require
fr_fr: Depuis le menu **Gestion > Contrats**, sélectionnez le contrat que vous souhaitez

source: From the **Print pdf** tab
fr_fr: Depuis l'onglet **Imprimer PDF**

source: Click on **Print**
fr_fr: Cliquez sur **Imprimer**

source: example
fr_fr: exemple

source: print PDF
fr_fr: imprimer PDF

source: Creative Commons License
fr_fr: Licence Creative Commons
