Repository: fdechelle/glpi-plugins-doc
Catalog: source/locale/*/LC_MESSAGES/credit/index.po
Languages: tr_tr

source: Sources link: https://github.com/pluginsGLPI/credit
tr_tr: Kaynak bağlantısı: https://github.com/pluginsGLPI/credit

source: Download: https://github.com/pluginsGLPI/credit/releases
tr_tr: İndirme bağlantısı: https://github.com/pluginsGLPI/credit/releases

source: Requirements for latest version
tr_tr: Son sürümün gereksinimleri

source: This plugin requires :
tr_tr: Bu uygulama ekinin gereksinimleri:

source: PHP 7.2 or higher
tr_tr: PHP 7.2 ve üzerindeki sürümler

source: GLPI >= 9.4
tr_tr: GLPI 9.4 ve üzerindeki sürümler

source: Features
tr_tr: Özellikler

source: This plugin allows you to declare and follow (by entity) the consumptions of different credit vouchers directly from the Ticket form.
tr_tr: Bu uygulama eki, çeşitli kredi kuponlarının doğrudan destek kaydı formundan kullanılabilmesini ve (birime göre) izlenebilmesini sağlar.

source: To do it, you must follow these steps:
tr_tr: Bunun için şu adımları izlemelisiniz:

source: Creation of different types of credit vouchers (as GLPI dropdown);
tr_tr: Çeşitli türlerde kredi kuponlarını oluşturmak (GLPI açılır menüsü olarak);

source: Creation, in Entity tab, of the credit vouchers available for these entities;
tr_tr: Birim sekmesinden bu birimler için kullanılabilecek kredi fişlerini oluşturmak,

source: Declaration / Modification / Deletion of a consumption in the Ticket form and tab;
tr_tr: Destek kaydı formu ve sekmesindeki bir kullanımı bildirmek / değiştirmek / silmek,

source: Consultation of the vouchers sold, the remaining credits, credits consumptions from the Ticket form or from Entity tab.
tr_tr: Satılan kuponları, kalan kredileri, kredi kullanımlarını destek kaydı formundan ya da birim sekmesinden değerlendirmek.

source: Configuration
tr_tr: Yapılandırma

source: The plugin will create required tables in the database automatically. Those tables will be updated along with the plugin.
tr_tr: Bu uygulama eki otomatik olarak veri tabanında gerekli tabloları oluşturur. Bu tablolar uygulama ekiyle birlikte güncellenir.

source: Plugin usage is quite simple:
tr_tr: Uygulama ekinin kullanımı oldukça basittir:

source: You will access the credit configuration from the *Administration* > *Entities*.
tr_tr: Kredi yapılandırmasına *Yönetim* > *Birimler* bölümüden erişebilirsiniz.

source: Name : add name to credit
tr_tr: Ad: Krediye bir ad verin

source: Type : Define a type
tr_tr: Tür: Bir tür belirtin

source: Start / End date : Define duration of credit
tr_tr: Başlangıç / bitiş tarihi: Kredinin süresini belirtin

source: Active : Display credit on ticket form or not
tr_tr: Etkin: Kredinin destek kayıtlarında görüntülenmesi için seçin

source: Quantity : quantity spend
tr_tr: Miktar: Harcanacak miktar

source: Allow overconsumption : allow or not over consumptin (if yes, check is bypass)
tr_tr: Aşırı kullanım yapılabilsin: Aşırı kullanıma izin verilmesi için seçin (etkinleştirildiğinde denetlenmez)

source: Credit consumption
tr_tr: Kredi kullanımı

source: When you solved a ticket, solution form have field to to consume credit
tr_tr: Bir destek kaydını çözümlediğinizde, çözüm formunda kredi kullanımı alanı bulunur

source: Credit report
tr_tr: Kredi raporu

source: On the ticket form, click on the *Credit* tab to view a report on credit consumption
tr_tr: Destek kaydı formunda, kredi kullanımı raporunu görüntülemek için *Kredi* sekmesine tıklayın
